tap "homebrew/bundle"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "koekeishiya/formulae"
tap "leoafarias/fvm"
tap "snyk/tap"
tap "teamookla/speedtest"
# Performance-portable, length-agnostic SIMD with runtime dispatch
brew "highway"
# General-purpose data compression with high compression ratio
brew "xz"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Emacs dependency management
brew "cask"
# Debugger for the Go programming language
brew "delve"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Tool for glamorous shell scripts
brew "gum"
# Simple terminal UI for git commands
brew "lazygit"
# YAML Parser
brew "libyaml"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Tool for working with usage-spec CLIs
brew "usage"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Python dependency management tool
brew "pipenv"
# Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Yet Another Dotfiles Manager
brew "yadm"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# Find & fix known vulnerabilities in open-source dependencies
brew "snyk/tap/snyk"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
mas "Advanced Screen Share", id: 1597458111
mas "Dato", id: 1470584107
mas "HP Smart", id: 1474276998
mas "Microsoft To Do", id: 1274495053
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "Toggl Track", id: 1291898086
mas "Xcode", id: 497799835
